<?php

use Illuminate\Database\Seeder;

class CourseSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        \App\Course::create([
            'name' => 'العصف الذهني',
            'description' => 'هو أحد أساليب الابداع الجماعي حيث تحاول المجموعة إيجاد حل لمشكلة ما عن طريق تجميع قائمة من الأفكار والحلول التي يساهم بها افراد المجموعة بشكل عفوي.',
        ]);
        \App\Course::create([
            'name' => 'عناصر التفكير الإبداعي',
            'description' => 'هي عبارة عن مجموعة من مهارات التفكيرالتي تساعد على انتاج الافكار الإبداعية الجديدة.',
        ]);
        \App\Course::create([
            'name' => 'القبعات الست',
            'description' => 'هي من أهم أساليب وطرق تنمية الإبداع في تحسين التفكير الإبداعي وتساعد قبعات التفكير الست على منح عملية التفكير قدرها من الوقت والجهد وترتكز العملية الإبداعية على أمر هام جداً وهو نمط التفكير عند الإنسان وأسلوب تعامله العقلي والفكري مع مجريات الأحداث المختلفة.',
        ]);
        \App\Course::create([
            'name' => 'حل المشكلات بطرق ابداعية',
            'description' => 'ي عملية تفكيرية مركبة ومنظمة ذات مراحل وخطوات محددة تهدف إلى مساعدتك للوصول إلى أفضل الحلول والأفكار لمشكلة ما،',
        ]);
        \App\Course::create([
            'name' => 'حل المشـــكلات المستقبلية',
            'description' => 'من أكثر الخبرات التربوية التي تساعد الطلبة على التفكير في المستقبل بصورة إيجابية, وموضوعها يمثل صورة خيالية مستقبلية ممكنة الحدوث , ويتم إعداد مشهد مستقبلي للمشكلة يســاعد ويشجع التلاميذ على الخيال , وعلى اســــتخراج التحديات المختلفة في مجالات عديدة لفترة محددة,ومن ثم إيجاد الحلول المناسبة لها.',
        ]);
        \App\Course::create([
            'name' => 'البحث العلمي',
            'description' => 'هو دراسة مشكلة ما بقصد حلها وفقا لقواعد علمية دقيقة، وهو وسيلة لطرح الأسئلة والإجابة العلمية عليها عن طريق الملاحظة والقيام بالتجارب وإثبات النتائج, وبالتالي هو تفكير علمي منظم يقوم بها شخص يسمى (الباحث) من أجل تقصي الحقائق في شأن مسألة أو مشكلة معينة تسمى (موضوع البحث العلمي) بإتباع طريقة علمية منظمة تسمى (منهج البحث العلمي)، بغية الوصول إلى حلول ملائمة للعلاج أو إلى نتائج صالحة للتعميم على المشكلات المماثلة تسمى (نتائج البحث العلمي) بهدف إثبات الفرضية أو نفيها ، وقد يؤدي هذا البحث إلى تصميم هندسي تتوفر فيه صفات العمل الإبداعي الابتكاري .',
        ]);
        \App\Course::create([
            'name' => 'المايكرو بت',
            'description' => ' هو عباره عن جهاز كمبيوتر صغري يتم برمجته عن طريق لغة الجافا سكريبت واللبنات الجاهزة يمكن من خلاله تعلم البرمجة ببساطة ومتعة وهو من انتاج هيئة الإذاعة البريطانية BBC في عام 2015 .',
        ]);
    }
}
