<?php

use Illuminate\Database\Seeder;

class ProgramSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        \App\Program::create([
            'name' => 'البرنامج الوطني للكشف عن الموهوبين',
            'description' => 'برنامج وطني مشترك ينفذ من قبل موهبة و وزارة التعليم والمركز الوطني للقياس للكشف عن ​الموهوبين" من خلال أدوات ومقاييس مقننة وأفضل الممارسات التربوية لضمان الانتقاء السليم للطلبة الواعدين بالموهبة، وتبني من خلالها قاعدة بيانات ضخمة و شاملة لجميع الموهوبين والموهوبات في كل مناطق ومدن المملكة ولجميع الفئات السنية في مراحل التعليم العام.',
        ]);
        \App\Program::create([
            'name' => 'الأولمبياد الوطني للإبداع العلمي',
            'description' => 'هو عبارة عن مسابقة علمية سنوية تقوم على أساس التنافس في أحد المجالات العلمية، من خلال تقديم مشاريع علمية فردية وفقاً للمعايير والضوابط الخاصة بالمشروع، ويتم تحكيمها إلكترونياً ومباشراً من قبل نخبة من الأكاديميين والمختصين وفق معايير علمية محددة بهدف تحديد المشاريع المتميزة لترشيحها للمراحل التنافسية الأعلى.',
        ]);
        \App\Program::create([
            'name' => 'فصول الموهوبين',
            'description' => 'مشروع يٌعنى بالاهتمام بفئة من الطلاب الموهوبين في مدارس التعليم العام من خلال تجميعهم في فصول دراسية يتلقون فيها دعماً مميزاً يتحدى قدراتهم ويثير الفضول العلمي لديهم لزيادة دافعيتهم لعمليات الاستقصاء وفق أفضل المعايير العالمية في تدريس الطلاب الموهوبين.',
        ]);
        \App\Program::create([
            'name' => 'مركز الموهوبين',
            'description' => 'مؤسسة تربوية تعليمية تعنى بتقديم الخدمات المخصصة للطلاب الموهوبين من خلال البرامج التي تقدم في المركز مباشرة أو بالتعاون مع الجهات الحكومية والمؤسسات الأهلية.',
        ]);
        \App\Program::create([
            'name' => 'البرامج الإثرائية العلمية خارج أوقات الدوام المدرسي',
            'description' => 'برامج إثرائية علمية توفر فرص تربوية متنوعة لجميع الطالبات الموهوبات لإبراز مواهبهن وتهيئة رعاية تربوية متخصصة لهن، صممت وفق النموذج الإثرائي الفاعل.',
        ]);
        \App\Program::create([
            'name' => 'نظام التسريع',
            'description' => 'نظام يعطي الطالب الذي يستوفي كامل شروط التسريع الحق في الانتقال عبر السلم التعليمي إلى صف دراسي أعلى بصف دراسي واحد من الصف الذي يدرس فيه. يُرشح للتسريع أعلى 2% من الطلبة المستهدفين في المشروع الوطني للتعرف على الموهوبين.',
        ]);
        \App\Program::create([
            'name' => 'رعاية الموهوبين المدرسي',
            'description' => 'برنامج يقدم رعاية تربوية شاملة ونوعية للطالب الموهوب من خلال تنفيذ برامج إثرائية متخصصة في المنهج الدراسي ضمن الفصل الدراسي العادي يقدم من قبل معلمي المواد ، وبرنامج إثرائي فاعل يقدم في غرفة الموهوبين من قبل معلم الموهوبين. ',
        ]);
        \App\Program::create([
            'name' => 'أسبوع الموهبة',
            'description' => 'برنامج يهدف لنشر ثقافة الموهبة والإبداع في المملكة العربية السعودية؛ من خلال برامج توعوية تقوم على مبدأ نشر ثقافة الموهبة والإبداع وإيصال رسالة علمية صحيحة لعموم فئات المجتمع لزيادة وعيهم للاهتمام بالموهوبين.',
        ]);
    }
}
