-- phpMyAdmin SQL Dump
-- version 4.9.1
-- https://www.phpmyadmin.net/
--
-- Host: localhost
-- Generation Time: 17 أغسطس 2020 الساعة 03:17
-- إصدار الخادم: 8.0.17
-- PHP Version: 7.3.10

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `talentedunit`
--

-- --------------------------------------------------------

--
-- بنية الجدول `teachers`
--

CREATE TABLE `teachers` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `name` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `idcard` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `mobile` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `email` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `specialization` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `image` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT 'default.png',
  `office_id` bigint(20) UNSIGNED NOT NULL,
  `school_id` bigint(20) UNSIGNED NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- إرجاع أو استيراد بيانات الجدول `teachers`
--

INSERT INTO `teachers` (`id`, `name`, `idcard`, `mobile`, `email`, `specialization`, `image`, `office_id`, `school_id`, `created_at`, `updated_at`) VALUES
(1, 'حسن مقبول محمد مغفوري', '1015214958', '503765005', 'ha4693@gmail.com', 'دين', 'default.png', 1, 268, '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(2, 'توفيق ابكر عقيل احمد آل عقيل', '1065235598', '505799712', 'tawfiqageel@gmail.com', 'دين', 'default.png', 1, 293, '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(3, 'توفيق ابكر عقيل احمد آل عقيل', '1065235598', '505799712', 'tawfiqageel@gmail.com', 'دين', 'default.png', 1, 78, '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(4, 'عبدالله علي احمد عشوي', '1044760997', '506457351', 'abd12352954@gmail.com', 'لغة عربية', 'default.png', 1, 283, '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(5, 'هيثم عبده محمد حكمي', '1049413584', '508913005', 'hahs13005@gmail.com', 'تربية موهوبين', 'default.png', 1, 347, '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(6, 'ابوبكر محمد عمر فرساني', '1066085455', '538051203', 'frsani123987@gmail.com', 'رياضيات', 'default.png', 1, 299, '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(7, 'احمد يحي جبران قيسي', '1081495572', '557246796', 'ahmad2015.phy@gmail.com', 'فيزياء', 'default.png', 1, 349, '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(8, 'محمد حسن محمد خضري', '1013587272', '502660165', 'mhmsk@hotmail.com', 'كيمياء', 'default.png', 1, 342, '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(9, 'حمد محمد فلقي', '1039889231', '535645697', 'sakman_falgy@hotmail.com', 'احياء', 'default.png', 1, 7, '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(10, 'احمد احمد محمد العشري', '2334016397', '508259311', 'ahmedelashry121@gmail.com', 'علوم', 'default.png', 1, 388, '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(11, 'حمد محمد فلقي', '1039889231', '535645697', 'sakman_falgy@hotmail.com', 'احياء', 'default.png', 1, 329, '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(12, 'عبدالله إبراهيم إبراهيم خرمي', '1079371777', '504571909', '', 'فيزياء', 'default.png', 1, 384, '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(13, 'عيسى يحيى محمد علواني', '1071248817', '542549593', 'essa-1411@hotmail.com', 'حاسب الي', 'default.png', 1, 94, '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(14, 'مدني عبدالرحيم ال حمود', '1014357667', '569779232', 'madane99@gmail.com', 'حاسب الي', 'default.png', 1, 85, '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(15, 'عبدالكريم عبدالله زيلعي', '1045259429', '0562006763', 'adeelk@gmail.com', 'حاسب آلي', 'default.png', 1, 80, '0000-00-00 00:00:00', '2020-08-16 16:40:47'),
(16, 'إبراهيم سالم نويبان السبيعي', '1065092559', '504577678', 'I_S_alsubaie@hotmail.com', 'حاسب الي', 'default.png', 1, 385, '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(17, 'علي احمد سالم القحطاني', '1070629827', '501663331', '', 'حاسب الي', 'default.png', 1, 91, '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(18, 'وجدي محمد إبراهيم نابوش', '1016972372', '536931420', 'waagdn@gmail.com', 'رياضيات', 'default.png', 1, 45, '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(19, 'تركي بخيت قليل الزهراني', '1078876909', '533320135', 'turki4300@hotmail.com', 'علوم', 'default.png', 1, 6, '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(20, 'تركي بخيت قليل الزهراني', '1078876909', '533320135', 'turki4300@hotmail.com', 'علوم', 'default.png', 1, 381, '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(21, 'المهند حسين حكمي', '1067771202', '552775654', '', 'رياضيات', 'default.png', 1, 102, '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(22, 'المهند حسين حكمي', '1067771202', '552775654', '', 'رياضيات', 'default.png', 1, 360, '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(23, 'احمد علي احمد مروعي', '1057249011', '54920987', '', 'رياضيات', 'default.png', 1, 207, '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(24, 'احمد علي احمد مروعي', '1057249011', '54920987', '', 'رياضيات', 'default.png', 1, 88, '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(25, 'فهد راشد احمد فاتك خرمي', '1060075759', '507765636', 'azz77686@gmail.com', 'مرشد طلابي', 'default.png', 1, 389, '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(26, 'علاء إبراهيم حملي', '1048162711', '507535350', 'aih14mb25jy@gmail.com', 'حاسب الي', 'default.png', 1, 390, '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(27, 'علاء إبراهيم حملي', '1048162711', '507535350', 'aih14mb25jy@gmail.com', 'حاسب الي', 'default.png', 1, 391, '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(28, 'حسن محمد عقيلي', '1061729750', '551818446', 'h.alayile@hotmail.com', 'رياضيات', 'default.png', 1, 276, '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(29, 'حسن محمد عقيلي', '1061729750', '551818446', 'h.alayile@hotmail.com', 'رياضيات', 'default.png', 1, 59, '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(30, 'حسن محمد عقيلي', '1061729750', '551818446', 'h.alayile@hotmail.com', 'رياضيات', 'default.png', 1, 392, '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(31, 'محمد مقبول هادي حكمي', '1073523183', '533512773', 'hakami1411@hotmail.com', 'رياضيات', 'default.png', 1, 70, '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(32, 'محمد علي محمد سنقوف', '1049501610', '568577687', 'modi0560@hotmail.com', 'علوم', 'default.png', 1, 145, '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(33, 'ماجد عبدالله إبراهيم كاملي', '1049472218', '556789267', 'aborakan1434@gmail.com', 'كيمياء', 'default.png', 1, 393, '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(34, 'ماجد عبدالله مبارك القحطاني', '1014510992', '503786896', 'myname1858@hotmail.com', 'رياضيات', 'default.png', 1, 277, '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(35, 'عبدالله احمد جابر المالكي', '1082007798', '535127172', '', '', 'default.png', 1, 394, '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(36, 'عبدالله صالح مزيبي', '1058972165', '503108125', '', 'مفرغ وكيل مدرسة', 'default.png', 1, 395, '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(37, 'عبدالعزيز محمد جعفري', '1044960274', '536226063', 'hfaqieh@gmail.com', 'لغة عربية', 'default.png', 1, 396, '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(38, 'عبدالعزيز محمد جعفري', '1044960274', '536226063', 'hfaqieh@gmail.com', 'لغة عربية', 'default.png', 1, 397, '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(39, 'سليمان مفرح علي الفيفي', '1063979429', '595030192', 'soliman14090826@hotmail.com', 'كيمياء', 'default.png', 1, 398, '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(40, 'سليمان مفرح علي الفيفي', '1063979429', '595030192', 'soliman14090826@hotmail.com', 'كيمياء', 'default.png', 1, 25, '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(41, 'علي احمد يحيى صوري', '1038246219', '567995055', 'al-veam999@hotmail.cpm', 'علوم', 'default.png', 1, 399, '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(42, 'عبدالله عمر عبدالله حمزي', '1101165981', '530611736', 'alhamzi.p.h@gmail.com', '', 'default.png', 1, 400, '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(43, 'عبدالمنعم خالد سليمان', '2162384818', '507561294', '', 'دين', 'default.png', 1, 190, '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(44, 'عبدالمنعم خالد سليمان', '2162384818', '507561294', '', 'دين', 'default.png', 1, 41, '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(45, 'إبراهيم علي إبراهيم عطيف', '1014921553', '595749230', 'otaif.ib@gmail.com', 'دين', 'default.png', 1, 92, '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(46, 'إبراهيم علي إبراهيم عطيف', '1014921553', '595749230', 'otaif.ib@gmail.com', 'دين', 'default.png', 1, 189, '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(47, 'عبدالله محمد محمد حكمي', '1088910482', '556614315', '', '', 'default.png', 1, 183, '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(48, 'بسام السعيد زين العابدين', '2321030989', '568142241', 'bassam20100@yahoo.com', 'حاسب الي', 'default.png', 1, 242, '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(49, 'صالح سالم صالح ابوراس', '2066349628', '505766237', 'aburas111@hotmail.com', 'لغة عربية', 'default.png', 1, 168, '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(50, 'يحيى عبده احمد شوعي', '1061766133', '535278889', 'yahyaabdu35@gmail.com', 'رياضة', 'default.png', 1, 307, '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(51, 'عادل شوعي احمد مقري', '1028746327', '555268640', 'malekmogi20@gmail.com', 'رياضيات', 'default.png', 1, 213, '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(52, 'عبدالوهاب محمد حسن النعمي', '1067038263', '532600491', 'aboasdf@hotmail.com', 'علوم', 'default.png', 1, 169, '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(53, 'حسين عمر سوادي', '1069659223', '582999252', 'raa121212@hotmail.com', 'اجتماعيات', 'default.png', 1, 182, '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(54, 'محمد بهلول علي خردلي', '1049019225', '540444124', '', '', 'default.png', 1, 169, '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(55, 'محمد فهد حسين حكمي', '1067155117', '507722170', 'mfh1001@hotmail.com', 'رياضيات', 'default.png', 1, 96, '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(56, 'محمد يحيى عبدالباري بريك', '1045778469', '505787668', '', '', 'default.png', 1, 125, '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(57, 'حسين يوسف عسيس', '1042866176', '505769633', '', '', 'default.png', 1, 401, '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(58, 'فهد إبراهيم محمد كوكو', '1013872500', '530958999', '', '', 'default.png', 1, 227, '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(59, 'ابراهيم ابكر عقيل احمد آل عقيل', '1065235606', '503090390', '', '', 'default.png', 1, 177, '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(60, 'حسين محمد احمد نجمي', '1079938559', '531173087', '', '', 'default.png', 1, 228, '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(61, 'عيسى ناصر حمد مكين', '1054303787', '500330777', '', '', 'default.png', 1, 252, '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(62, 'عيسى ناصر حمد مكين', '1054303787', '500330777', '', '', 'default.png', 1, 134, '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(63, 'عبدالله محمد محمد حكمي', '1088910482', '556614315', '', '', 'default.png', 1, 310, '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(64, 'عيسى يحيى محمد علواني', '1071248817', '542549593', 'essa-1411@hotmail.com', 'حاسب الي', 'default.png', 1, 402, '0000-00-00 00:00:00', '0000-00-00 00:00:00'),
(128, 'حمد جيلان حسن مدخلي', '1058609429', NULL, NULL, NULL, 'default.png', 4, 74, NULL, NULL);

--
-- Indexes for dumped tables
--

--
-- Indexes for table `teachers`
--
ALTER TABLE `teachers`
  ADD PRIMARY KEY (`id`),
  ADD KEY `teachers_office_id_foreign` (`office_id`),
  ADD KEY `teachers_school_id_foreign` (`school_id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `teachers`
--
ALTER TABLE `teachers`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=130;

--
-- قيود الجداول المحفوظة
--

--
-- القيود للجدول `teachers`
--
ALTER TABLE `teachers`
  ADD CONSTRAINT `teachers_office_id_foreign` FOREIGN KEY (`office_id`) REFERENCES `offices` (`id`) ON DELETE CASCADE,
  ADD CONSTRAINT `teachers_school_id_foreign` FOREIGN KEY (`school_id`) REFERENCES `schools` (`id`) ON DELETE CASCADE;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
